tutorials/2206/hisDriftFluxFoam/flowCellCase_long/Allrun
#!/bin/bash
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh

runApplication setFields

runApplication decomposePar -force

mpirun -np $(getNumberOfProcessors) $(getApplication) -parallel


#------------------------------------------------------------------------------
